In [10]:
import pandas as pd

In [11]:
import webbrowser
website = 'https://es.wikipedia.org/wiki/Anexo:Campeones_de_la_NBA'
webbrowser.open(website)

True

In [13]:
dataFrame_nba = pd.read_clipboard()

In [14]:
dataFrame_nba

,Año,Campeón,del,Oeste,Resultado,Campeón.1,del.1,Este,Ref.
0,1950,Minneapolis,Lakersn.,2​,4–2,Syracuse,Nationals†,19​18​,NaN
1,1951,Rochester,Royals,4–3,New,York,Knicks,20​,NaN
2,1952,Minneapolis,Lakers,4–3,New,York,Knicks,21​,NaN
3,1953,Minneapolis,Lakers†,4–1,New,York,Knicks,22​,NaN
4,1954,Minneapolis,Lakers†,4–3,Syracuse,Nationals,23​,None,NaN
5,1955,Ft.,Wayne,Pistons,3–4,Syracuse,Nationals†,24​,NaN
6,1956,Ft.,Wayne,Pistons,1–4,Philadelphia,Warriors†,25​,NaN
7,1957,St.,Louis,Hawks,3–4,Boston,Celtics†,26​,NaN
8,1958,St.,Louis,Hawks,4–2,Boston,Celtics†,27​,NaN
9,1959,Minneapolis,Lakers,0–4,Boston,Celtics†,28​,None,NaN
10,1960,St.,Louis,Hawks,3–4,Boston,Celtics†,29​,NaN

In [15]:
# Titulo de las columnas
dataFrame_nba.columns

Index(['Año', 'Campeón', 'del', 'Oeste', 'Resultado', 'Campeón.1', 'del.1',
       'Este', 'Ref.'],
      dtype='object')

In [16]:
# Mirar el contenido de una columna
dataFrame_nba['Resultado']

0          4–2
1          New
2          New
3          New
4     Syracuse
5          3–4
6          1–4
7          3–4
8          4–2
9       Boston
10         3–4
Name: Resultado, dtype: object

In [17]:
# buscar una fila
dataFrame_nba.loc[5]

Año                1955
Campeón             Ft.
del               Wayne
Oeste           Pistons
Resultado           3–4
Campeón.1      Syracuse
del.1        Nationals†
Este                24​
Ref.                NaN
Name: 5, dtype: object

In [18]:
# Muestra las 3 primeras lineas
dataFrame_nba.head(3)

,Año,Campeón,del,Oeste,Resultado,Campeón.1,del.1,Este,Ref.
0,1950,Minneapolis,Lakersn.,2​,4–2,Syracuse,Nationals†,19​18​,NaN
1,1951,Rochester,Royals,4–3,New,York,Knicks,20​,NaN
2,1952,Minneapolis,Lakers,4–3,New,York,Knicks,21​,NaN

In [20]:
# Muestra los 2 ultimos
dataFrame_nba.tail(2)

     Año      Campeón     del  Oeste Resultado Campeón.1     del.1  Este  Ref.
9   1959  Minneapolis  Lakers    0–4    Boston  Celtics†       28​  None   NaN
10  1960          St.   Louis  Hawks       3–4    Boston  Celtics†   29​   NaN

In [21]:
# CREAR DICCIONARIO APARTIR DE UNAS LISTAS
lista_asignaturas = ['historia','fisica','biologia']
lista_notas = [8,7,9]
diccionario = {'Asignaturas':lista_asignaturas, 'Notas':lista_notas}

In [22]:
diccionario

{'Asignaturas': ['historia', 'fisica', 'biologia'], 'Notas': [8, 7, 9]}

In [23]:
# CREAR DATAFRAME APARTIR DEL DICCIONARIO
dataframe_notas = pd.DataFrame(diccionario)

In [24]:
dataframe_notas

  Asignaturas  Notas
0    historia      8
1      fisica      7
2    biologia      9